using System.Collections.Generic;

namespace botaniastory
{
    public static class LexiconUIData
    {
        // Этот метод просто возвращает твой большой словарь с координатами
        public static Dictionary<string, double[]> GetDefaultUI()
        {
            return new Dictionary<string, double[]>()
            {
                { "Книга_Фон", new double[] { 10, 0, 1156, 820, 1 } },
                { "Левая_Страница", new double[] { 100, 100, 300, 480, 1.45 } },
                { "Правая_Страница", new double[] { 651, 100, 300, 440, 1.45 } },
                { "Кнопка_Назад", new double[] { 70, 750, 38, 30, 2 } },
                { "Кнопка_Вперед", new double[] { 1006, 750, 40, 30, 2 } },
                { "Шестеренка", new double[] { 1132, 660, 61, 55, 1 } },
                { "Кнопка_Дебаггера", new double[] { 1135, 740, 80, 30, 1 } },
                { "Вкладка_Зеленая", new double[] { 1135, 108, 60, 55, 1.05 } },
                { "Вкладка_Фиолетовая", new double[] { 1136, 43, 62, 55, 1.25 } },
                { "Строка_Поиска", new double[] { 201, 730, 180, 30, 1 } },
                { "Кнопка_Закладки", new double[] { 1132, 570, 63, 57, 1 } },
                { "Кат_Сетка_Иконки", new double[] { 90, 161, 74, 76, 1 } },
                { "Кат_Сетка_Шаг", new double[] { 120, 140, 4, -20, 1 } },
                { "Кат_Сетка_Текст", new double[] { -1, 80, 106, 40, 1 } },
                { "Заголовок_Левый", new double[] { 50, 80, 463, 30, 1.1 } },
                { "Список_Глав_Координаты", new double[] { 90, 160, 691, 110, 1 } },
                { "Список_Глав_Шаг", new double[] { 57, 53, 11, 14, 1.6 } },
                { "Список_Глав_Иконки", new double[] { 0, 0, 0, 0, 1.45 } },
                { "Закладки_Сбоку", new double[] { 1134, 177, 85, 75, 0.75 } },
                { "Закладки_Сбоку_Предмет", new double[] { 0, -2, 0, 0, 1 } },
                { "Звезда_Избранного", new double[] { -27, 19, 12, 12, 1.3 } },
                { "Рецепт_Сетка", new double[] { 711, 160, 150, 150, 1.35 } },
                { "Рецепт_Сетка_Левая", new double[] { 150, 160, 150, 150, 1.35 } },
                { "Рецепт_Результат", new double[] { 850, 400, 50, 50, 1 } },
                { "Кнопка_Визуализации", new double[] { 731, 580, 200, 40, 1 } },
                { "Приветствие_Картинка", new double[] { 991, -5, 90, 541, 0.95 } },
                { "Картинка_Левая", new double[] { 100, 158, 300, 200, 1.4 } },
                { "Картинка_Правая", new double[] { 641, 210, 300, 235, 1.4 } },
                { "Приветствие_Текст", new double[] { 651, 100, 290, 546, 1.1 } },
                { "Аптекарь_Область", new double[] { 661, 229, 250, 250, 1.4 } },
                { "Аптекарь_Фон", new double[] { 701, 190, 250, 250, 1.4 } },
                { "Альфхейм_Область", new double[] { 681, 200, 250, 250, 1 } },
                { "Альфхейм_Фон", new double[] { 681, 200, 250, 250, 1 } },
                // --- НОВЫЕ (Левые) координаты ---
                { "Аптекарь_Область_Левая", new double[] { 161, 229, 250, 250, 1.4 } },
                { "Аптекарь_Фон_Левая", new double[] { 201, 190, 250, 250, 1.4 } },
                { "Альфхейм_Область_Левая", new double[] { 181, 200, 250, 250, 1 } },
                { "Альфхейм_Фон_Левая", new double[] { 181, 200, 250, 250, 1 } },
                { "Полоска_Маны_1", new double[] { 690, 740, 340, 18, 1 } },
                { "Полоска_Маны_Левая", new double[] { 150, 740, 340, 18, 1 } }
            };
        }

    }
}